; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v6 - type_1)
 	      (pred_1 ?v8 - object ?v6 - type_1)
	      (pred_4 ?v2 - type_3 ?v5 - type_2)
	      (pred_3 ?v2 - type_3 ?v8 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v2 - type_3 ?v1 ?v4 - type_1)
       :precondition (and  (pred_2 ?v2 ?v1))
       :effect (and  (pred_2 ?v2 ?v4)
		     (not (pred_2 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_3 ?v3 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v7) (pred_2 ?v2 ?v7) (pred_4 ?v2 ?v5))
       :effect (and (pred_3 ?v2 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v7)) 
		    (not (pred_4 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_3 ?v3 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v3 ?v5) (pred_2 ?v2 ?v7))
       :effect (and (pred_1 ?v3 ?v7)
		    (pred_4 ?v2 ?v5)
		    (not (pred_3 ?v2 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_02 - type_3
obj_03 obj_13 obj_10 obj_08 - type_2
obj_05 obj_12 obj_06 obj_09 - type_1
obj_04 obj_07 obj_01 - object)
(:init
(pred_2 obj_11 obj_06)
(pred_4 obj_11 obj_03)
(pred_4 obj_11 obj_13)
(pred_2 obj_02 obj_12)
(pred_4 obj_02 obj_10)
(pred_4 obj_02 obj_08)
(pred_1 obj_04 obj_06)
(pred_1 obj_07 obj_12)
(pred_1 obj_01 obj_05)
)
(:goal
(and
(pred_1 obj_04 obj_09)
(pred_1 obj_07 obj_12)
(pred_1 obj_01 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_09)))
)
)

; plan
1. (op_1 obj_11 obj_04 obj_06 obj_13)
   deleted: (pred_1 obj_04 obj_06) (pred_4 obj_11 obj_13)
   added: (pred_3 obj_11 obj_04 obj_13)
   goals met: 1 of 3
2. (op_2 obj_02 obj_12 obj_05)
   deleted: (pred_2 obj_02 obj_12)
   added: (pred_2 obj_02 obj_05)
   goals met: 1 of 3
3. (op_1 obj_02 obj_01 obj_05 obj_08)
   deleted: (pred_1 obj_01 obj_05) (pred_4 obj_02 obj_08)
   added: (pred_3 obj_02 obj_01 obj_08)
   goals met: 1 of 3
4. (op_2 obj_02 obj_05 obj_09)
   deleted: (pred_2 obj_02 obj_05)
   added: (pred_2 obj_02 obj_09)
   goals met: 1 of 3
5. (op_3 obj_02 obj_01 obj_09 obj_08)
   deleted: (pred_3 obj_02 obj_01 obj_08)
   added: (pred_1 obj_01 obj_09) (pred_4 obj_02 obj_08)
   goals met: 2 of 3
6. (op_2 obj_02 obj_09 obj_06)
   deleted: (pred_2 obj_02 obj_09)
   added: (pred_2 obj_02 obj_06)
   goals met: 2 of 3
7. (op_3 obj_11 obj_04 obj_06 obj_13)
   deleted: (pred_3 obj_11 obj_04 obj_13)
   added: (pred_1 obj_04 obj_06) (pred_4 obj_11 obj_13)
   goals met: 2 of 3
8. (op_1 obj_02 obj_04 obj_06 obj_08)
   deleted: (pred_1 obj_04 obj_06) (pred_4 obj_02 obj_08)
   added: (pred_3 obj_02 obj_04 obj_08)
   goals met: 2 of 3
9. (op_2 obj_02 obj_06 obj_09)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_09)
   goals met: 2 of 3
10. (op_3 obj_02 obj_04 obj_09 obj_08)
   deleted: (pred_3 obj_02 obj_04 obj_08)
   added: (pred_1 obj_04 obj_09) (pred_4 obj_02 obj_08)
   goals met: 3 of 3
